; domain
(define (domain healthcare)

  (:requirements :strips :typing)

  (:types
    location unit robot box supply person - object
    guide_robot - robot
    box_robot - robot
  )

  (:predicates

    (adjacent ?l1 ?l2 - location)
    (belongs ?u - unit ?l - location)
    (atl ?r - robot ?u - location)
    (at ?b - box ?l - location)
    (has_supply_at ?s - supply ?l - location)
    (has ?r - box_robot ?b - box)
    (has_supply ?b - box ?s - supply)
    (has_unit ?s - supply ?u - unit)
    (is_loading_point ?l - location)
    (free ?r - robot)
    (empty ?b - box)
    (in ?p - person ?u - unit)
    (inl ?p - person ?l - location)
    (accompanying ?r - guide_robot ?p - person)

  )

  (:action move_box
    :parameters (?r - box_robot ?from - location ?to - location ?b - box)
    :precondition (and (atl ?r ?from) (adjacent ?from ?to) (has ?r ?b) (at ?b ?from))
    :effect (and (not (atl ?r ?from)) (not(at ?b ?from)) (atl ?r ?to) (at ?b ?to))
  )

  (:action move_empty
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (atl ?r ?from) (adjacent ?from ?to))
    :effect (and (not (atl ?r ?from)) (atl ?r ?to))
  )

  (:action load_box
    :parameters (?b - box ?s - supply ?r - box_robot ?l - location)
    :precondition (and (empty ?b) (at ?b ?l) (atl ?r ?l) (free ?r) (has_supply_at ?s ?l))
    :effect (and (not (empty ?b)) (not (free ?r)) (has_supply ?b ?s) (has ?r ?b))
  )
  
  (:action empty_box
    :parameters (?b - box ?s - supply ?r - box_robot ?l - location ?u - unit)
    :precondition (and (has_supply ?b ?s) (at ?b ?l) (atl ?r ?l) (belongs ?u ?l) (has ?r ?b))
    :effect (and (free ?r) (empty ?b) (has_unit ?s ?u) (not (has_supply ?b ?s)))
  )

  (:action start_accompany
    :parameters (?r - guide_robot ?l - location ?p - person)
    :precondition (and (atl ?r ?l) (inl ?p ?l) (free ?r))
    :effect (and (not (free ?r)) (accompanying ?r ?p))
  )

  (:action guide_person
    :parameters (?r - guide_robot ?from - location ?to - location ?p - person)
    :precondition (and (atl ?r ?from) (inl ?p ?from) (adjacent ?from ?to) (accompanying ?r ?p))
    :effect (and (not (atl ?r ?from)) (not (inl ?p ?from)) (atl ?r ?to) (inl ?p ?to))
  )

  (:action accompany
    :parameters (?r - guide_robot ?l - location ?p - person ?u - unit)
    :precondition (and (atl ?r ?l) (inl ?p ?l) (belongs ?u ?l) (accompanying ?r ?p))
    :effect (and (not (accompanying ?r ?p)) (free ?r) (in ?p ?u))
  )
)

; problem
(define (problem hc1) (:domain healthcare)
(:objects 
r1 r3 - box_robot
r2 - guide_robot
l1 l2 l3 - location
u1 u2 u3 - unit
b1 b2 b3 - box
p1 p2 - person
s1 s2 s3 - supply
)

(:init
    (adjacent l1 l2)
    (adjacent l2 l1)
    (adjacent l2 l3)
    (adjacent l3 l2)
    (is_loading_point l1)
    (belongs u1 l3)
    (belongs u2 l3)
    (belongs u3 l2)
    (at b1 l1)
    (at b2 l1)
    (at b3 l1)
    (atl r1 l2)
    (atl r2 l2)
    (atl r3 l2)
    (inl p1 l2)
    (inl p2 l2)
    (in p1 u3)
    (in p2 u3)
    (free r1)
    (free r2)
    (free r3)
    (empty b1)
    (empty b2)
    (empty b3)
    (has_supply_at s1 l1)
    (has_supply_at s2 l1)
    (has_supply_at s3 l1)
)

(:goal (and
    (has_unit s1 u1)
    (has_unit s3 u1)
    (has_unit s2 u2)
    (in p1 u2)
    (in p2 u1)
))

;un-comment the following line if metric is needed
;(:metric minimize (???))
)

; plan
1. (start_accompany r2 l2 p1)
   deleted: (free r2)
   added: (accompanying r2 p1)
   goals met: 0 of 5
2. (move_empty r3 l2 l1)
   deleted: (atl r3 l2)
   added: (atl r3 l1)
   goals met: 0 of 5
3. (load_box b3 s3 r3 l1)
   deleted: (empty b3) (free r3)
   added: (has_supply b3 s3) (has r3 b3)
   goals met: 0 of 5
4. (move_empty r1 l2 l1)
   deleted: (atl r1 l2)
   added: (atl r1 l1)
   goals met: 0 of 5
5. (move_box r3 l1 l2 b3)
   deleted: (atl r3 l1) (at b3 l1)
   added: (atl r3 l2) (at b3 l2)
   goals met: 0 of 5
6. (move_box r3 l2 l3 b3)
   deleted: (atl r3 l2) (at b3 l2)
   added: (atl r3 l3) (at b3 l3)
   goals met: 0 of 5
7. (empty_box b3 s3 r3 l3 u1)
   deleted: (has_supply b3 s3)
   added: (free r3) (empty b3) (has_unit s3 u1)
   goals met: 1 of 5
8. (guide_person r2 l2 l3 p1)
   deleted: (atl r2 l2) (inl p1 l2)
   added: (atl r2 l3) (inl p1 l3)
   goals met: 1 of 5
9. (accompany r2 l3 p1 u2)
   deleted: (accompanying r2 p1)
   added: (free r2) (in p1 u2)
   goals met: 2 of 5
10. (move_empty r2 l3 l2)
   deleted: (atl r2 l3)
   added: (atl r2 l2)
   goals met: 2 of 5
11. (start_accompany r2 l2 p2)
   deleted: (free r2)
   added: (accompanying r2 p2)
   goals met: 2 of 5
12. (guide_person r2 l2 l3 p2)
   deleted: (atl r2 l2) (inl p2 l2)
   added: (atl r2 l3) (inl p2 l3)
   goals met: 2 of 5
13. (accompany r2 l3 p2 u1)
   deleted: (accompanying r2 p2)
   added: (free r2) (in p2 u1)
   goals met: 3 of 5
14. (move_empty r3 l3 l2)
   deleted: (atl r3 l3)
   added: (atl r3 l2)
   goals met: 3 of 5
15. (move_empty r3 l2 l1)
   deleted: (atl r3 l2)
   added: (atl r3 l1)
   goals met: 3 of 5
16. (load_box b2 s1 r1 l1)
   deleted: (empty b2) (free r1)
   added: (has_supply b2 s1) (has r1 b2)
   goals met: 3 of 5
17. (move_box r1 l1 l2 b2)
   deleted: (atl r1 l1) (at b2 l1)
   added: (atl r1 l2) (at b2 l2)
   goals met: 3 of 5
18. (move_box r1 l2 l3 b2)
   deleted: (atl r1 l2) (at b2 l2)
   added: (atl r1 l3) (at b2 l3)
   goals met: 3 of 5
19. (empty_box b2 s1 r1 l3 u1)
   deleted: (has_supply b2 s1)
   added: (free r1) (empty b2) (has_unit s1 u1)
   goals met: 4 of 5
20. (move_empty r1 l3 l2)
   deleted: (atl r1 l3)
   added: (atl r1 l2)
   goals met: 4 of 5
21. (load_box b1 s2 r3 l1)
   deleted: (empty b1) (free r3)
   added: (has_supply b1 s2) (has r3 b1)
   goals met: 4 of 5
22. (move_box r3 l1 l2 b1)
   deleted: (atl r3 l1) (at b1 l1)
   added: (atl r3 l2) (at b1 l2)
   goals met: 4 of 5
23. (move_box r3 l2 l3 b1)
   deleted: (atl r3 l2) (at b1 l2)
   added: (atl r3 l3) (at b1 l3)
   goals met: 4 of 5
24. (empty_box b1 s2 r3 l3 u2)
   deleted: (has_supply b1 s2)
   added: (free r3) (empty b1) (has_unit s2 u2)
   goals met: 5 of 5
